blog/goals-2022.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-01-20 Fri 11:19 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Open Source goals for 2022/2023</title>
<meta name="author" content="Rémi Louf" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../style.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">Open Source goals for 2022/2023</h1>
<p>
Summer vacations is coming to an end and though I have left school for more than 10 years, I have kept a habit of setting my technical and learning goals in September. I set personal and professional goals in January.
</p>

<div id="outline-container-org3230406" class="outline-2">
<h2 id="org3230406">The past year in review</h2>
<div class="outline-text-2" id="text-org3230406">
<p>
Let's review the past year briefly. It has been fruitful:
</p>

<ul class="org-ul">
<li>The projects I am a part of (the <a target='_blank' rel='noopener noreferrer' class='external' href="https://github.com/aesara-devs">Aesara ecosystem</a>, <a target='_blank' rel='noopener noreferrer' class='external' href="https://github.com/blackjax-devs/blackjax">Blackjax</a>, <a target='_blank' rel='noopener noreferrer' class='external' href="https://github.com/pollsposition">Pollsposition</a>) have made sensible progress and are gaining momentum.</li>
<li>Working in close proximity with great people, including but not only (in handle alphabetical order) <a target='_blank' rel='noopener noreferrer' class='external' href="https://twitter.com/BrandonTWillard">@BrandonTWillard</a>, <a target='_blank' rel='noopener noreferrer' class='external' href="https://twitter.com/dgerlanc">@dgerlanc</a>, <a target='_blank' rel='noopener noreferrer' class='external' href="https://twitter.com/jeffreydenos">@jeffreydenos</a> and <a target='_blank' rel='noopener noreferrer' class='external' href="https://twitter.com/junpenglao">@junpenglao</a>, has made me a better developer.</li>
<li>Thanks to <a target='_blank' rel='noopener noreferrer' class='external' href="https://twitter.com/BrandonTWillard">@BrandonTWillard</a> I have now fully transitioned from vim to emacs.</li>
<li>I have picked up <a target='_blank' rel='noopener noreferrer' class='external' href="https://racket-lang.org/">Racket</a>;</li>
<li>I learned about relational programming, in particular <a href="../20220804135950-minikanren.html#ID-f4cf39be-6c6a-4a9d-804a-3879a98177bc">miniKanren</a>.</li>
<li>My thoughts on efficient note-taking, knowledge sharing and what a "better Internet" would look like are getting clearer, thanks to the <a target='_blank' rel='noopener noreferrer' class='external' href="https://thetypicalset.com">typical set project</a>, which I set in motion this year.</li>
<li>I predicted the results of the French presidential elections with <a target='_blank' rel='noopener noreferrer' class='external' href="https://twitter.com/alex_andorra">@alex<sub>andorra</sub></a> and <a target='_blank' rel='noopener noreferrer' class='external' href="https://twitter.com/pollsposition">@pollsposition</a> (although a serious injury in February prevented me from doing more). I went on TV the night of the election!</li>
</ul>
</div>
</div>

<div id="outline-container-orga83ee50" class="outline-2">
<h2 id="orga83ee50">Hello 2022/2023</h2>
<div class="outline-text-2" id="text-orga83ee50">
<p>
Here are the goals that I would try to achieve this coming year:
</p>

<ul class="org-ul">
<li><a target='_blank' rel='noopener noreferrer' class='external' href="https://github.com/aesara-devs/aemcmc">AeMCMC</a> can build samplers with 99% of models encountered in the wild;</li>
<li><a target='_blank' rel='noopener noreferrer' class='external' href="https://github.com/aesara-devs/aehmc">AeHMC</a>’s NUTS sampler’s performance is on par with Blackjax’s;</li>
<li><a target='_blank' rel='noopener noreferrer' class='external' href="https://github.com/aesara-devs/aesara">Aesara</a> uses <a href="../20220822170959-e_graphs.html#ID-0617e358-6824-43b5-a3a7-4ed2074000dc">e-graphs</a> and equality saturation for its graph rewrites;</li>
<li><a target='_blank' rel='noopener noreferrer' class='external' href="https://github.com/blackjax-devs/blackjax">Blackjax</a>’s V1 is released;</li>
<li>The Blackjax paper is ready for submission;</li>
<li><a target='_blank' rel='noopener noreferrer' class='external' href="https://github.com/pythological/kanren">miniKanren’s python implementation</a> <a href="solve-sudokus-kanren.html">solves sudoku grid</a> almost as fast as the imperative solution;</li>
<li>Implementation of something similar to <a target='_blank' rel='noopener noreferrer' class='external' href="https://github.com/mxgmn/WaveFunctionCollapse">WaveFunctionCollapse</a> with miniKanren;</li>
<li>The typical set is self-hosted on the most energy efficient stack possible.</li>
</ul>

<p>
And more generally improve thetypicalset’s design, navigation and overall content quality. I would like to learn some <a target='_blank' rel='noopener noreferrer' class='external' href="https://www.rust-lang.org/">Rust</a> and learn more about internet protocols (why not implement a HTTP server in Rust?) if time allows.
</p>
</div>
</div>
</div>
</body>
</html>